tutorials/eulerVortex.twitch/eulerVortex.cyclic.twitch.test.test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver PBiCGStab;
      preconditioner DILU;
      tolerance 1e-06;
      relTol 0.01;
    }

    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
	tolerance 1e-05;
	relTol 0;
    }

    "(U|h|e|R|k|epsilon|omega)"
    {
      solver smoothSolver;
      smoother symGaussSeidel;
      tolerance 1e-05;
      relTol 0.1;
    }
}


PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    transonic           yes;
    nNonOrthogonalCorrectors 0;

    rhoMin              0.1;
    rhoMax              100.0;
}

relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}


























  /*
solvers
{
  p
    {
      solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-07;
        relTol          0.01;
    }

    pFinal
    {
        $p;
	tolerance  1e-07;
        relTol          0;
    }
    
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    "rho.*"
    {
        solver          diagonal;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|h|e|R|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|h|e|R|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
    
    cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
	}
}

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    transonic           yes;
    nNonOrthogonalCorrectors 0;

    //rhoMin              0.1;
    //rhoMax              100.0;
    pMax 1000000;
    
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}
  */

// ************************************************************************* //
